In [1]:
import numpy as np
import pandas as pd

In [2]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [3]:
df=pd.DataFrame(np.arange(12).reshape(6,2),hier_index,["Column1","Column2"])
df

      Column1  Column2
G1 1        0        1
   2        2        3
   3        4        5
G2 1        6        7
   2        8        9
   3       10       11

In [4]:
df.loc['G1'].iloc[1]

Column1    2
Column2    3
Name: 2, dtype: int32

In [5]:
df.loc['G2']

   Column1  Column2
1        6        7
2        8        9
3       10       11

In [6]:
df['Column1']

G1  1     0
    2     2
    3     4
G2  1     6
    2     8
    3    10
Name: Column1, dtype: int32

In [7]:
df.loc['G1'].iloc[1]['Column1']

2

In [8]:
df.xs(1,level=1)
##############

    Column1  Column2
G1        0        1
G2        6        7

In [9]:
df.xs('G1')

   Column1  Column2
1        0        1
2        2        3
3        4        5

In [10]:
df.xs(2,level=1)

    Column1  Column2
G1        2        3
G2        8        9

# Missing Data

In [11]:
divya={'A':[1,2,3],'B':[1,2,np.nan],'C':[np.nan,2,np.nan]}
divya

{'A': [1, 2, 3], 'B': [1, 2, nan], 'C': [nan, 2, nan]}

In [12]:
df_new=pd.DataFrame(divya)
df_new

   A    B    C
0  1  1.0  NaN
1  2  2.0  2.0
2  3  NaN  NaN

In [13]:
df_new.dropna()

   A    B    C
1  2  2.0  2.0

In [14]:
df_new.dropna(axis=1)

   A
0  1
1  2
2  3

In [15]:
df_new.dropna(thresh=2)

   A    B    C
0  1  1.0  NaN
1  2  2.0  2.0

In [16]:
df_new

   A    B    C
0  1  1.0  NaN
1  2  2.0  2.0
2  3  NaN  NaN

In [17]:
df_new.fillna(value=0)

   A    B    C
0  1  1.0  0.0
1  2  2.0  2.0
2  3  0.0  0.0

In [18]:
df_new.fillna(value="Hi")

   A   B   C
0  1   1  Hi
1  2   2   2
2  3  Hi  Hi

In [19]:
df_new

   A    B    C
0  1  1.0  NaN
1  2  2.0  2.0
2  3  NaN  NaN

In [20]:
#Groupby

In [21]:
data={'Company':['Google','Google','FACEBOOK','FACEBOOK','WHATSAPP','WHATSAPP'],'Person':['Divya','Ayush','Vinayak','Aman','Tamanna','Rahul'],'Sales':[12,15,20,30,40,50]}

In [22]:
data

{'Company': ['Google',
  'Google',
  'FACEBOOK',
  'FACEBOOK',
  'WHATSAPP',
  'WHATSAPP'],
 'Person': ['Divya', 'Ayush', 'Vinayak', 'Aman', 'Tamanna', 'Rahul'],
 'Sales': [12, 15, 20, 30, 40, 50]}

In [23]:
df2_new=pd.DataFrame(data)
df2_new

    Company   Person  Sales
0    Google    Divya     12
1    Google    Ayush     15
2  FACEBOOK  Vinayak     20
3  FACEBOOK     Aman     30
4  WHATSAPP  Tamanna     40
5  WHATSAPP    Rahul     50

In [24]:
bycomp=df2_new.groupby('Company')
print(bycomp)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F8E5D9AB50>

In [25]:
bycomp.mean()

          Sales
Company
FACEBOOK   25.0
Google     13.5
WHATSAPP   45.0

In [26]:
bycomp.std()

             Sales
Company
FACEBOOK  7.071068
Google    2.121320
WHATSAPP  7.071068

In [27]:
bycomp.median()

          Sales
Company
FACEBOOK   25.0
Google     13.5
WHATSAPP   45.0

In [28]:
bycomp.sum()

          Sales
Company
FACEBOOK     50
Google       27
WHATSAPP     90

In [29]:
bycomp.sum().iloc[0]

Sales    50
Name: FACEBOOK, dtype: int64

In [30]:
bycomp.sum().loc['FACEBOOK']

Sales    50
Name: FACEBOOK, dtype: int64

In [31]:
bycomp.max()

           Person  Sales
Company
FACEBOOK  Vinayak     30
Google      Divya     15
WHATSAPP  Tamanna     50

In [32]:
bycomp.min()

         Person  Sales
Company
FACEBOOK   Aman     20
Google    Ayush     12
WHATSAPP  Rahul     40

In [33]:
bycomp.count()

          Person  Sales
Company
FACEBOOK       2      2
Google         2      2
WHATSAPP       2      2

In [34]:
bycomp.describe().transpose()

Company       FACEBOOK    Google   WHATSAPP
Sales count   2.000000   2.00000   2.000000
      mean   25.000000  13.50000  45.000000
      std     7.071068   2.12132   7.071068
      min    20.000000  12.00000  40.000000
      25%    22.500000  12.75000  42.500000
      50%    25.000000  13.50000  45.000000
      75%    27.500000  14.25000  47.500000
      max    30.000000  15.00000  50.000000